In [1]:
import numpy as np
import pandas as pd
import re

pd.set_option('display.max_columns', None)

C:\Users\Isabel\AppData\Local\Temp\ipykernel_808\1016511574.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.read_csv("../csv-archivos/HR RAW DATA.csv", index_col=0)
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

# FUNCIONES

In [3]:
# def word_to_num(dato):
    
#     if len(dato) > 2:
#         dato = w2n.word_to_num(dato)
#         return dato

#     else:
#         return dato

In [4]:
def true_false(valor):
   
    if valor in ['Yes', 'yes', '1', 'Y']:
        valor = True
    
    elif valor in ['False', 'No', '0', 'false']:
        valor = False
    

    else:
        valor = np.nan

    return valor

In [5]:
def to_float(valor):
    try:
        if type(valor) != str or np.nan:
            str(valor)
        
            
        if '$' in valor:
            valor = valor.replace('$', '')
        elif '%' in valor:
            valor = valor.replace('%', '')
        return float(valor.replace(",", "."))
        
    
    except:
        
        return np.nan

In [6]:
def unificacion(valor):
    if type(valor) == str:
        return valor.lower().strip()
    else:
        return valor

# LISTAS

In [7]:
lista_bool = ['Attrition', 'RemoteWork', 'OverTime']
lista_float =  ['employeenumber', 'PerformanceRating', 'TOTALWORKINGYEARS','DailyRate', 'WORKLIFEBALANCE', 'MonthlyIncome']
# lista_object = df.describe(include='object')

In [10]:
df.columns

Index(['Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeenumber',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED', 'OverTime',
       'PercentSalaryHike', 'PerformanceRating', 'RelationshipSatisfaction',
       'StockOptionLevel', 'TOTALWORKINGYEARS', 'TrainingTimesLastYear',
       'WORKLIFEBALANCE', 'YearsAtCompany', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'DateBirth', 'RemoteWork'],
      dtype='object')

# LIMPIEZA

In [8]:
df.drop(['employeecount', 'NUMBERCHILDREN', 'SameAsMonthlyIncome', 'Salary', 'Age', 'Over18', 'StandardHours', 'RoleDepartament', 'YearsInCurrentRole'], axis=1, inplace=True)

In [11]:
df['EnvironmentSatisfaction'] = df['EnvironmentSatisfaction'].apply(lambda x: x if x in range(1,5) else np.nan)

In [12]:
df['BusinessTravel'] = df['BusinessTravel'].map({"non-travel":"no", "travel_rarely":"rarely", "travel_frequently":"frequently"})

In [13]:
df["DistanceFromHome"] = abs(df["DistanceFromHome"])

In [14]:
df['Gender'] = df['Gender'].map({1: "F", 0: 'M'})

In [ ]:
df['MaritalStatus'] = df['MaritalStatus'].str.replace('marreid', 'married')

In [16]:
df['HourlyRate'] = df['HourlyRate'].replace('Not Available', np.nan)

In [17]:
df["PercentSalaryHike"] = (df["PercentSalaryHike"]).astype(float) / 100

In [18]:
for columna in lista_float:

    df[columna] = df[columna].apply(to_float)

In [19]:
for columna in lista_bool:
    df[columna] = df[columna].apply(true_false)

In [20]:
df = df.apply(unificacion)

In [21]:
nuevas_columnas = []
for nombre in df.columns:

    patron = re.compile(r'[a-zA-Z][a-z]*[A-Z][a-z][\d]*')

    if re.search(patron, nombre):
        col_sep = re.sub(r'(?<=[a-z])(?=[A-Z])', '_', nombre) #cada vez que encuentro una minúscula seguida de mayúscula lo cambio por _ 
        nuevas_columnas.append(col_sep.lower().strip())
    
    elif nombre == 'employeenumber':
        nuevas_columnas.append('employee_number')
    
    elif nombre == 'NUMCOMPANIESWORKED':
        nuevas_columnas.append('num_companies_worked')
    
    elif nombre == 'TOTALWORKINGYEARS':
        nuevas_columnas.append('total_working_years')

    elif nombre == 'WORKLIFEBALANCE':
            nuevas_columnas.append('work_life_balance')

    elif nombre == 'YEARSWITHCURRMANAGER':
        nuevas_columnas.append('years_with_current_manager')
    
    else:
        nuevas_columnas.append(nombre.lower())
    

    dict_columns = {}

    for indice, valor in zip(df.columns, nuevas_columnas):
        dict_columns[indice] = valor

    df.rename(columns=dict_columns, inplace=True)

In [22]:
lista_object = df.describe(include='object')

In [23]:
for columna in lista_object:
    df[columna] = df[columna].apply(unificacion)

In [24]:
df.drop_duplicates(inplace=True)

In [31]:
df.to_csv('../csv-archivos/datos_sql.csv')